Revit 2027 API
BuiltInFailures.DuctFailures.NoDuctFittingsInProject Property
 There are no duct fittings defined in project. The default duct type for fittings will be set to none.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoDuctFittingsInProject { get; }
Public Shared ReadOnly Property NoDuctFittingsInProject As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoDuctFittingsInProject {
	FailureDefinitionId^ get ();
}
static member NoDuctFittingsInProject : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DuctFailures Class
Autodesk.Revit.DB Namespace